request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getTelloRequest>
            <gs:name>Kyriad</gs:name>
        </gs:getTelloRequest>
    </soapenv:Body>
</soapenv:Envelope>